{
  "projects": [
    {
      "name": "Fabriken & Lagerhäuser",
      "shortDescription": "Dieses Projekt ist eine Webanwendung, die eine logische Herausforderung darstellt, basierend auf der Optimierung von Verbindungen.",
      "longDescription": "Der Spieler hat ein Spielfeld vor sich, auf dem sich 7 Fabriken an festgelegten Orten befinden. Die Aufgabe des Spielers ist es, 4 Lager an beliebigen Standorten zu platzieren und die Fabriken mit den Lagern so zu verbinden, dass jede Fabrik Zugang zu mindestens einem Lager hat. Das Ziel des Spiels ist es, das kürzeste Netzwerk von Verbindungen zu erstellen. Der Spieler, der den kürzesten Weg verwendet, um die Fabriken mit den Lagern zu verbinden, gewinnt und kommt an die Spitze der Rangliste. Um die Herausforderung zu erhöhen, haben wir auch einen Algorithmus entwickelt, der die optimale Lösung berechnet, sodass die Ergebnisse mit dem theoretisch besten möglichen Ergebnis verglichen werden können.",
      "images": [
        {
          "src": "fabryki1.jpg",
          "alt": "Erstes Bild"
        },
        {
          "src": "fabryki2.jpg",
          "alt": "Zweites Bild"
        },
        {
          "src": "fabryki3.jpg",
          "alt": "Drittes Bild"
        }
      ]
    },
    {
      "name": "Musikalischer Controller",
      "shortDescription": "Wir haben ein Skript entwickelt, das es ermöglicht, den Computer mit einer MIDI-Tastatur zu steuern, und damit neue Interaktionsmöglichkeiten mit Anwendungen und Spielen eröffnet.",
      "longDescription": "Unser Projekt ist eine innovative Verbindung von Musik und Technologie! Das Skript, das wir entwickelt haben, ermöglicht es, eine MIDI-Tastatur zur Steuerung des Computers zu verwenden. Dadurch kann jeder Tastenanschlag auf dem Instrument den entsprechenden Funktionen der Computertastatur oder Mausaktionen zugeordnet werden, was völlig neue Möglichkeiten der Interaktion mit Anwendungen und Spielen bietet. Die Idee entstand aus dem Wunsch zu experimentieren und Spaß zu haben, und ihre Umsetzung basiert auf der Programmiersprache Python. Das Skript ist einfach anzupassen – jeder Benutzer kann selbst die MIDI-Tasten nach seinen Bedürfnissen und Ideen den Funktionen des Computers zuordnen. Das Projekt ist offen für weitere Verbesserungen, und wir laden alle ein, gemeinsam zu experimentieren und technologische Werkzeuge kreativ zu nutzen.",
      "images": []
    }
  ]
}
