[
    {
      
      "title": "Magdalena",
      "description": "<b>Magdalena – Modularna Automatyczna Głowicowa Drukarka Adaptacyjna z Logiką Ekspandowalną i Napędem Inercyjno-Adaptacyjnym</b> to koncepcja nowoczesnej, modułowej drukarki 3D pracującej w technologii FDM, której konstrukcja oparta jest na uniwersalnym module mechanicznym wykorzystywanym również w projekcie szachowym. Bazując na gotowej ramie z mechaniką typu CoreXY, urządzenie zostanie przystosowane do pracy z różnymi głowicami narzędziowymi, z możliwością automatycznej wymiany – zarówno w oparciu o autorski system, jak i gotowe rozwiązania, takie jak Bondtech.<br><br>Projekt zakłada pełne sterowanie online, z możliwością dalszego dopracowania technologii komunikacji i interfejsu użytkownika. Drukarka będzie zabudowana, z aktywną kontrolą temperatury wewnątrz komory roboczej, co zapewni stabilne warunki druku dla wymagających materiałów. Integralną częścią konstrukcji będzie również wydajny system filtracji powietrza, umożliwiający bezpieczną pracę w zamkniętych pomieszczeniach.<br><br>Wewnątrz komory znajdzie się kamera, zapewniająca podgląd procesu drukowania w czasie rzeczywistym. Dodatkowo kamera może zostać wykorzystana do analizy obrazu i wczesnego wykrywania błędów druku. System zostanie wyposażony w magnetyczny stół roboczy ułatwiający zdejmowanie wydruków, a także szereg czujników monitorujących m.in. zaplątanie filamentu, poprawność działania głównych komponentów czy postępujące zużycie elementów mechanicznych. W przyszłości urządzenie może być rozbudowane o funkcjonalność wycinarki laserowej, dzięki czemu stanie się wielofunkcyjnym narzędziem warsztatowym.",
      "images": [
        
      ]
    },

   {
  "title": "Szach-Mat 3.0",
  "description": "<center><b>Projekt Szach-Mat 3.0 to całkowicie nowa generacja naszej znanej konstrukcji.</b></center><br><br>Projekt Szachy 3.0 to całkowicie nowa generacja naszej znanej konstrukcji. Planujemy pełną przebudowę planszy, poprawę elementów, których nie udało się dopracować wcześniej, oraz dodanie funkcji gry ręcznej. Chcemy stworzyć system bardziej niezawodny, estetyczny i łatwiejszy w utrzymaniu, który stanie się naszym głównym, flagowym projektem.<br><br>W ramach prac powstanie nowy model 3D planszy, zostanie zaprojektowana od podstaw płytka PCB i świeże schematy elektryczne. Wprowadzimy FreeRTOS na mikrokontroler oraz porządny protokół komunikacji. Ustalimy ostateczną metodę wykrywania ruchów gracza, wdrożymy lepszy algorytm sterowania wózkiem oraz przeprojektujemy całą sekcję elektroniki, aby była trwalsza i wygodniejsza w serwisie.<br><br>Projekt opiera się na technologii mikrokontrolerów, modelowaniu 3D, projektowaniu elektroniki oraz tworzeniu algorytmów. Do zespołu zapraszamy elektroników, techników i programistów gotowych współtworzyć nową odsłonę naszego najbardziej rozpoznawalnego projektu.",
  "images": []
},

{
  "title": "Project Airlight",
  "description": "<center><b>Project Airlight to lekki i bardzo efektowny pomysł na przesyłanie dźwięku za pomocą wiązki światła.</b></center><br><br>Project Airlight to lekki i bardzo efektowny pomysł na przesyłanie dźwięku za pomocą wiązki światła. Naszym celem jest stworzenie w pełni interaktywnego modelu, który pokaże, że komunikacja optyczna może być prosta, dostępna i zaskakująco skuteczna. Planujemy zbudować dwa niewielkie moduły — emiter i odbiornik — w drukowanych w 3D obudowach. Emiter będzie przyjmował sygnał z gniazda Jack 3,5 mm i zamieniał go na modulowaną wiązkę światła, natomiast odbiornik, wykorzystując panel fotowoltaiczny, przetworzy odebrany sygnał na dźwięk i wyśle go na głośnik. W projekcie użyjemy przewodzącego filamentu FDM oraz prostej elektroniki.<br><br>Airlight będzie miał również rozbudowaną część edukacyjną — chcemy szczegółowo opisać zjawiska fizyczne, wyjaśnić cały proces przetwarzania sygnału i przedstawić schemat działania. To projekt, który łączy ciekawy efekt z solidną wartością akademicką. Potrzebujemy przede wszystkim osób znających podstawy elektroniki oraz chętnych do przygotowania dokumentacji i opisów technicznych.",
  "images": []
},

{
  "title": "Projekt AWC",
  "description": "<center><b>Projekt AWC (Active Waves Cancellation) to długodystansowe i technicznie wymagające przedsięwzięcie.</b></center><br><br>Projekt AWC (Active Waves Cancellation) to długodystansowe i technicznie wymagające przedsięwzięcie, którego celem jest aktywne wykrywanie fal, analizowanie ich parametrów oraz generowanie fal przeciwnych w celu niwelowania sygnału przychodzącego. Docelowo chcemy stworzyć niewielne, przenośne urządzenie, które można będzie zamontować na dronach. Prace obejmują zaprojektowanie elektroniki, obudowy i kluczowych podzespołów.<br><br>Projekt będzie realizowany etapowo — na początku spróbujemy odtworzyć mechanizm ANC znany z wyciszania hałasu w słuchawkach, a następnie przejdziemy do bardziej złożonych sygnałów, z myślą o przyszłym działaniu również w zakresie mikrofal. Potencjalne zastosowania są szczególnie istotne w obszarze obronności, gdzie taka technologia mogłaby chronić infrastrukturę przed różnego rodzaju zakłóceniami i zagrożeniami. Do pracy wykorzystamy zagadnienia fizyki fal, mikrokontrolery, czujniki, elektronikę oraz algorytmy do analizy sygnału i generowania odpowiedzi.",
  "images": []
},

{
  "title": "Projekt p-UAP-ka",
  "description": "<center><b>Projekt p-UAP-ka to pomysł na stworzenie przenośnego systemu do obserwacji nieba i wykrywania niezidentyfikowanych zjawisk atmosferycznych.</b></center><br><br>Projekt p-UAP-ka to pomysł na stworzenie przenośnego systemu do obserwacji nieba i wykrywania niezidentyfikowanych zjawisk atmosferycznych. Chcemy zbudować urządzenie odporne na warunki zewnętrzne, które będzie mogło pracować w trybie ciągłym, monitorować niebo i gromadzić wiarygodne dane o pojawiających się obiektach. System ma wykorzystywać dwie zsynchronizowane kamery 360°, co pozwoli określić odległość i wielkość obserwowanego zjawiska, a wszystkie dane będą zapisywane w bazie.<br><br>W projekcie wykorzystamy fizykę atmosfery i takie zjawiska jak rozpraszanie Rayleigha, aby analizować parametry obiektów — m.in. kolor, przeźroczystość, pochłanianie i odbicie światła. Potrzebne będą narzędzia do przetwarzania obrazu, w tym filtracja i wykrywanie obiektów. Całość oprzemy na mikrokontrolerze, np. Raspberry Pico, które obsłuży system, zapis danych i lokalną bazę. To projekt łączący fizykę, elektronikę i analizę obrazu w jednym spójnym rozwiązaniu.",
  "images": []
}





]
